tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setSet -batch makeCellSets.setSet
runApplication splitMeshRegions -cellZones -overwrite

# remove fluid fields from solid regions (important for post-processing)
for i in heater leftSolid rightSolid
do
   rm -f 0*/$i/{rho,mut,alphat,epsilon,k,p,U,p_rgh,Qr,G,IDefault}
done

## remove solid fields from fluid regions (important for post-processing)
for i in bottomAir topAir
do
    rm -f 0*/$i/{Ypmma,Ychar}
done

for i in bottomAir topAir heater leftSolid rightSolid
do
    changeDictionary -region $i > log.changeDictionary.$i 2>&1
done


for i in bottomAir topAir
do
    faceAgglomerate -region $i > log.faceAgglomerate.$i 2>&1
done

for i in bottomAir topAir
do
    viewFactorsGen -region $i > log.viewFactorsGen.$i 2>&1
done



#-- Run on single processor
runApplication chtMultiRegionSimpleFoam

## Decompose
#for i in bottomAir topAir heater leftSolid rightSolid
#do
#   decomposePar -region $i > log.decomposePar.$i 2>&1
#done
#
## Run
#runParallel chtMultiRegionSimpleFoam 4
#
## Reconstruct
#for i in bottomAir topAir heater leftSolid rightSolid
#do
#   reconstructPar -region $i > log.reconstructPar.$i 2>&1
#done


echo
echo "creating files for paraview post-processing"
echo
for i in bottomAir topAir heater leftSolid rightSolid
do
    paraFoam -touch -region $i
done

# ----------------------------------------------------------------- end-of-file
